export default[{
        "id": "5c41a9826eaa56ce964660d1",
        "title": "Найдите ошибки в следующем коде.",
        "text": "unsigned int i;for (i = 100; i >= 0; --i) printf('%d', i);",
        "date": "2020-01-13",
        "check": true
    },
    {
        "id": "5c41a96954d75b8175170c47",
        "title": "Объясните, что делает этот код.",
        "text": "((n & (n – 1)) == 0)",
        "date": "2020-06-20",
        "check": true
    },
    {
        "id": "5c41a96933a2ffb202d6077a",
        "title": "Title 1",
        "text": "Дано 100-этажное здание. Если яйцо сбросить с высоты N-го этажа (или с большей высоты), оно разобьется. Если его бросить с любого меньшего этажа, оно не разобьется. У вас есть два яйца. Найдите N за минимальное количество бросков.",
        "date": "2020-06-18",
        "check": true
    },
    {
        "id": "5c41a969a0c43f15ff64bd04",
        "title": "Title 1",
        "text": "Продолжаем задачки по С/С++. Что означает ключевое слово volatile и в каких ситуация оно может быть применено? Если даже помните формальное значение, попробуйте привести пример ситуации, где volatile на самом деле будет полезно.",
        "date": "2020-06-19",
        "check": true
    },
    {
        "id": "5c41a969d8368d90b58f97d0",
        "title": "Title 1",
        "text": "У вас есть отсортированная матрица размера MxN. Предложите алгоритм поиска в ней произвольного элемента.",
        "date": "2020-06-10",
        "check": false
    },
    {
        "id": "5c41a9692877528af3a0118c",
        "title": "Title 1",
        "text": "Напишите метод, находящий максимальное из двух чисел, не используя операторы if-else или любые другие операторы сравнения.",
        "date": "2020-06-01",
        "check": false
    },
    {
        "id": "5c41a96957ee7cdd749ac1a7",
        "title": "Title 1",
        "text": "На пустынном шоссе вероятность появления автомобиля за 30-минутный период составляет 0.95. Какова вероятность его появления за 10 минут?",
        "date": "2020-02-20",
        "check": false
    },
    {
        "id": "5c41a9697f8f6f3e79cc45a2",
        "title": "Title 1",
        "text": "Напишите функцию суммирования двух целых чисел без использования «+» и других арифметических операторов.",
        "date": "2020-02-28",
        "check": false
    },
    {
        "id": "5c41a969e7ec938813e367ce",
        "title": "Title 1",
        "text": "Где вы будете плыть быстрее — в воде или сиропе?",
        "date": "2020-01-01",
        "check": false
    },
    {
        "id": "5c41a96958e72726bd367d19",
        "title": "Title 1",
        "text": "Дано 20 баночек с таблетками. В 19 из них лежат таблетки весом 1 г, а в одной – весом 1.1 г. Даны весы, показывающие точный вес. Как за одно взвешивание найти банку с тяжелыми таблетками?",
        "date": "2020-01-13",
        "check": false
    },
    {
        "id": "5c41a96992a7e41e964659e1",
        "title": "Title 1",
        "text": "Короткая задачка по С++ в виде вопроса для новичков. Почему деструктор полиморфного базового класса должен объявляться виртуальным?",
        "date": "2020-01-03",
        "check": false
    },
    {
        "id": "5c41a9696b86f13d7ff6119e",
        "title": "Title 1",
        "text": "Напишите функцию, меняющую местами значения переменных, не используя временные переменные. Предложите как можно больше вариантов.",
        "date": "2020-01-16",
        "check": false
    },
    {
        "id": "5c41a969e5d301855d0de3ea",
        "title": "Title 1",
        "text": "Напишите функцию, определяющую количество битов, которые необходимо изменить, чтобы из целого числа А получить целое число B. Числа, допустим, 32-битные, язык любой.",
        "date": "2020-03-13",
        "check": false
    },
    {
        "id": "5c41a96944cb27e9734b7767",
        "title": "Title 1",
        "text": "В книге N страниц, пронумерованных как обычно от 1 до N. Если сложить количество цифр, содержащихся в каждом номере страницы, будет 1095. Сколько страниц в книге?",
        "date": "2020-01-25",
        "check": false
    },
    {
        "id": "5c41a9690190f94a03c95818",
        "title": "Title 1",
        "text": "Разработайте класс, обеспечивающий блокировку так, чтобы предотвратить возникновение мертвой блокировки.",
        "date": "2020-04-14",
        "check": false
    },
    {
        "id": "5c41a969b6626ac40728cd57",
        "title": "Title 1",
        "text": "Напишите функцию на С++, выводящую в стандартный поток вывода K последних строк файла. При этом файл очень большой, допустим 50 ГБ, длина каждой строки не превышает 256 символов, а число K < 1000.",
        "date": "2020-04-12",
        "check": false
    },
    {
        "id": "5c41a969790d034b1256bbd4",
        "title": "Title 1",
        "text": "Реализуйте метод, определяющий, является ли одна строка перестановкой другой. Под перестановкой понимаем любое изменение порядка символов. Регистр учитывается, пробелы являются существенными.",
        "date": "2020-04-28",
        "check": false
    },
    {
        "id": "5c41a9695d3dd90bba748b0f",
        "title": "Title 1",
        "text": "У скольких целых чисел, лежащих в диапазоне от 1 до 1000, есть цифра 3? Посчитать нужно без использования компьютера, приведя свои рассуждения в комментариях.",
        "date": "2020-05-01",
        "check": false
    },
    {
        "id": "5c41a9699874c326739809f4",
        "title": "Title 1",
        "text": "У вас есть много URL-адресов, порядка 10 миллиардов. Как бы вы организовали эффективный поиск дубликатов, учитывая, что все они, конечно же, не поместятся в памяти?",
        "date": "2020-05-03",
        "check": true
    },
    {
        "id": "5c41a96969d54c10b62c0f75",
        "title": "Title 1",
        "text": "Разработайте алгоритм, обнаруживающий в массиве все пары целых чисел, сумма которых равна заданному значению.",
        "date": "2020-05-05",
        "check": true
    },
    {
        "id": "5c41a969f1f6e3824b04ffb8",
        "title": "Title 1",
        "text": "Напишите код, удаляющий дубликаты из несортированного связного списка. Можно использовать только константную память.",
        "date": "2020-05-06",
        "check": true
    },
    {
        "id": "5c41a9691da6bf17eab94561",
        "title": "Title 1",
        "text": "Какой минимальный комплект монет необходим для того, чтобы выдать любую сдачу от 1 до 99 центов? Доступные номиналы монет: 1, 5, 10, 25, 50 центов и 1 доллар.",
        "date": "2020-05-18",
        "check": true
    },
    {
        "id": "5c41a969fc1adee4104b7fd4",
        "title": "Title 1",
        "text": "Задачка, которую нужно решать без калькулятора и компьютера, имея под рукой только карандаш и бумагу. Сколько нулей в конце факториала 100?",
        "date": "2020-05-25",
        "check": true
    },
    {
        "id": "5c41a969bc62ccb919d67063",
        "title": "Title 1",
        "text": "Предложите алгоритм нахождения самой большой суммы непрерывной последовательности из массива целых чисел, как положительных, так и отрицательных.",
        "date": "2020-06-10",
        "check": true
    },
    {
        "id": "5c41a969c8c3250a691ab851",
        "title": "Title 1",
        "text": "Напишите программу расчета значения медианы в потоке чисел, динамически отслеживающую новые поступающие числа, получаемые рандомом.",
        "date": "2020-06-24",
        "check": true
    }
]